In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Age": [25, np.nan, 35, 40, np.nan],
    "City": ["New York", "Los Angeles", np.nan, "Houston", "Phoenix"],
    "Salary": [50000, 60000, 75000, np.nan, 45000]
}

df = pd.DataFrame(data)

In [3]:
print(df.isna())

    Name    Age   City  Salary
0  False  False  False   False
1  False   True  False   False
2  False  False   True   False
3  False  False  False    True
4  False   True  False   False

In [33]:
print(df)

      Name        Age         City   Salary
0    Alice  25.000000     New York  50000.0
1      Bob  33.333333  Los Angeles  60000.0
2  Charlie        NaN          NaN  75000.0
3    David  40.000000      Houston      NaN
4      Eve  33.333333      Phoenix  45000.0

In [34]:
print(df.dropna(thresh=3))

    Name        Age         City   Salary
0  Alice  25.000000     New York  50000.0
1    Bob  33.333333  Los Angeles  60000.0
3  David  40.000000      Houston      NaN
4    Eve  33.333333      Phoenix  45000.0

In [4]:
print(df.isna().sum())

Name      0
Age       2
City      1
Salary    1
dtype: int64

In [6]:
print(df.dropna())

    Name   Age      City   Salary
0  Alice  25.0  New York  50000.0

In [7]:
print(df.dropna(axis=1))

      Name
0    Alice
1      Bob
2  Charlie
3    David
4      Eve

In [8]:
print(df.fillna(0))

      Name   Age         City   Salary
0    Alice  25.0     New York  50000.0
1      Bob   0.0  Los Angeles  60000.0
2  Charlie  35.0            0  75000.0
3    David  40.0      Houston      0.0
4      Eve   0.0      Phoenix  45000.0

In [13]:
df["Age"].fillna(df["Age"].mean())

0    25.000000
1    33.333333
2    35.000000
3    40.000000
4    33.333333
Name: Age, dtype: float64

In [14]:
df["Salary"].fillna(df["Salary"].median())

0    50000.0
1    60000.0
2    75000.0
3    55000.0
4    45000.0
Name: Salary, dtype: float64

In [15]:
print(df.fillna(method="ffill"))

      Name        Age         City   Salary
0    Alice  25.000000     New York  50000.0
1      Bob  33.333333  Los Angeles  60000.0
2  Charlie  35.000000  Los Angeles  75000.0
3    David  40.000000      Houston  75000.0
4      Eve  33.333333      Phoenix  45000.0

C:\Users\ajays\AppData\Local\Temp\ipykernel_15896\1103946584.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method="ffill"))

In [16]:
print(df.fillna(method = "bfill"))

      Name        Age         City   Salary
0    Alice  25.000000     New York  50000.0
1      Bob  33.333333  Los Angeles  60000.0
2  Charlie  35.000000      Houston  75000.0
3    David  40.000000      Houston  45000.0
4      Eve  33.333333      Phoenix  45000.0

C:\Users\ajays\AppData\Local\Temp\ipykernel_15896\1897337824.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method = "bfill"))

In [32]:
df.iloc[2,1] =np.nan
print(df)

      Name        Age         City   Salary
0    Alice  25.000000     New York  50000.0
1      Bob  33.333333  Los Angeles  60000.0
2  Charlie        NaN          NaN  75000.0
3    David  40.000000      Houston      NaN
4      Eve  33.333333      Phoenix  45000.0

In [31]:
df_interpolated = df.interpolate()
print(df_interpolated)

      Name        Age         City   Salary
0    Alice  25.000000     New York  50000.0
1      Bob  33.333333  Los Angeles  60000.0
2  Charlie  36.666667          NaN  75000.0
3    David  40.000000      Houston  60000.0
4      Eve  33.333333      Phoenix  45000.0

C:\Users\ajays\AppData\Local\Temp\ipykernel_15896\876667172.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df_interpolated = df.interpolate()

In [ ]:
df.isna() / df.isnull()	     Find missing values
df.isna().sum()	             Count missing values per column
df.dropna()	                 Remove rows with NaN values
df.dropna(axis=1)	         Remove columns with NaN values
df.fillna(value)	         Fill NaN with a specific value
df.fillna(df["col"].mean())	 Fill NaN with column mean
df.fillna(method="ffill")	 Forward-fill missing values
df.fillna(method="bfill")	 Backward-fill missing values
df.interpolate()	         Estimate missing values mathematically
df.dropna(thresh=n)	         Keep rows with at least n non-null values